In [17]:
import numpy as np

In [19]:
import pandas as pd

In [21]:
labels = ['a', 'b', 'c']

my_data = [10, 20, 30]

arr = np.array(my_data) #an array is a fixed-sized collection of values with same
#data types. it is  used for fast mathematical operations and handling large 
#datasets efficiently.

#the difference between 'list' and 'arrays' is that 'list' can store multiple
#data types at a time, while 'arrays' cannot and only have one data type at a time

d = {'a':10,
     'b': 20,
     'c': 30
    }

In [23]:
pd.Series(my_data) #a series is different from an array because it can
#contain different data types. it is heterogenous, while arrays are homogenous.

0    10
1    20
2    30
dtype: int64

In [25]:
pd.Series(data = my_data, index = labels) #keywords 'data' and 'index',
#ensure that the positions would not change if they are called out later
#in the program.

#an example is:
#def describe_person(name, age):
    #print(f"{name} is {age} years old.")

#describe_person(age=30, name="Alice") <-- notice that even if 'age' is
#first in the order rather than 'name', the printed display still ends
#up following a proper order based on the parameters passed.

#output: Alice is 30 years old.

a    10
b    20
c    30
dtype: int64

In [26]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [29]:
pd.Series(arr) #this is another way to create a series, where you can
#pass a numpy array containing the simple list. 

#notice that the index representation is seen in the left.

0    10
1    20
2    30
dtype: int64

In [30]:
pd.Series(arr, labels) #if you want to change the real default index
#representation, we can also add 'labels', so instead of '0','1','2',
#it will be 'a', 'b', 'c' as indicated in the 'labels' list made above.

a    10
b    20
c    30
dtype: int64

In [33]:
pd.Series(d) #another thing you can do is simply pass the dictionary.
#what this does is that the keys 'a','b','c' immediately replace
#the real default index representations, while the values '10','20','30'
#are set as their corresponding data points.

a    10
b    20
c    30
dtype: int64

In [35]:
#NOTE: the amazing difference with PANDAS series is that they can hold
#a variety of data types, in comparison to arrays which can't.

In [37]:
#EXAMPLE OF HOW TO GRAB INFORMATION FROM A SERIES -------------------->

In [38]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'USSR', 'Japan'])
#an example of how to grab information from a series

ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [39]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'USSR', 'Japan'])
#an example of how to grab information from a series

ser1['USA'] #if 'USA' would be considered as python key, then '1', 
#is the value.

1

In [41]:
ser3 = pd.Series(data = labels) #above we have created a varible called
#'labels' which contain ' = ['a', 'b', 'c']' as a list.

#the 'data' keyword is used to ensure that the 'labels' variable will be
#recognized as data points.

#as we display 'ser3', a column of default index number representations
#appear which correspond to each data point.

ser3

0    a
1    b
2    c
dtype: object

In [45]:
#the output above means that you can use 'ser3' to grab the data type
#objects 'a', 'b', 'c' by their default index number representations.

# an example is by using:

ser3[0] 

#which will grab and return data point 'a'

'a'

In [47]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'USSR', 'Japan'])
#an example of how to grab information from a series

ser1.loc['Germany'] #if ['USA', 'Germany', 'USSR', 'Japan'] represent
#python keys, and [1,2,3,4] represent values, then the LOC keyword is 
#used to determine or get the value representation of its corresponding
#key.

2

In [49]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'USSR', 'Japan'])
#an example of how to grab information from a series

ser1.iloc[2] #if ['USA', 'Germany', 'USSR', 'Japan'] represent
#python keys, and [1,2,3,4] represent values, then the ILOC keyword is 
#used to

3

In [51]:
#NEXT LESSONS---------------------------------------------------------->

In [53]:
import numpy as np
import pandas as pd

In [55]:
from numpy.random import randn

In [57]:
np.random.seed(101) #seed is used to randomly generate the same specific 
#numbers as Jose.

In [59]:
df = pd.DataFrame(randn(5, 4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

#note that the first argument after 'randn(5, 4)', means you are setting
#' ROWS', and the second argument means you are setting ' COLUMNS'

#the '5' in (5,4) means that you are setting 5 rows, while the '4' means that
#you are setting 4 columns.
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
#HOW TO GRAB (EXAMPLES) - SINGLE

df['W'] #you are grabbing all ROWS under the 'W' COLUMN.
#Note that the 'W' COLUMN is just a SERIES.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [63]:
type(df['W']) #by using this code, we can see the type of data it is.

pandas.core.series.Series

In [65]:
type(df) #shows what data type as listed below.

pandas.core.frame.DataFrame

In [67]:
#another way to grab is not by using df['W'], but by using dots which is similar
#to SQL:

df.W

#HOWEVER, IT IS NOT ALWAYS RECOMMENDED AS YOU MAY GET CONFUSED LATER ON SINCE
#PYTHON METHODS USUALLY ALSO REQUIRE THE NEED TO '.' BEFORE SPECIFYING WHAT
#YOU INTEND TO DO. SO IT IS BETTER TO JUST USE BRACKETS.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [69]:
#HOW TO GRAB (EXAMPLES) - MULTIPLE

#You can do so by passing a list containing the columns you desire to be
#displayed
df[['W','Z']]

#by asking to display multiple columns, you are asking for a 'dataframe', while
#asking for a single column is you asking for a 'series'

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [71]:
#if you simply use 'df['new'], python will display an error, the proper way to
#create a new column is similar to how you add a new element to a list.

df['new'] = df['W'] + df['Y']

#in the example above, you create a new column in the dataframe 'df' known as 
#'new', this is the variable that will store the outputs of the sums of
#single column 'W' and single colum 'Y' to be displayed.

df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [73]:
#HOW TO DROP (EXAMPLES) - COLUMNS
#now, if you want to delete a specific column you can do so by:

df.drop('new', axis = 1) 

#remember to use parenthesis and not brackets for this as '.drop()' is a method
#in python pandas used to delete, drop, or remove.

#NOTE THAT 'axis' PARAMETER NEEDS TO BE STATED OTHERWISE PYTHON WILL SEND AN
#AN ERROR. AXIS IS USED TO DETERMINE IF IT IS A ROW OR COLUMN.

#axis = 1 <--- Column
##axis = 0 <--- Row

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df #however, you will notice that if you display the dataframe 'df' again, then
#nothing seems to have changed.

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [77]:
#if you want to secure or make the changes permanent, you must set another 
#parameter argument:
df.drop('new', axis = 1, inplace = True)

#pandas usually requires you to specify the 'inplace' argument in order to avoid
#data losses or mistakes, like if for example you have done adjustments to your
#data, if it were permanently removed by itself without the 'inplace' argument,
#then obviously we would have a hard time if such accidents happen.

#because of this, 'inplace' is specified so that changes will occur or stay in
#place.

#now if you call df, then the 'new' column has now been permanently removed
#actually.
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
#HOW TO DROP (EXAMPLES) - ROWS
df.drop('E', axis = 0) # 'axis = 0' is used because we are referring to 'rows'

#you may also not set the axis argument as simply saying df.drop('E') would
#still display the same results regardless.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [81]:
#REFERENCE A SINGLE ROW ONLY

#first way:

df.loc['A'] #'loc' stands for location

#this code, returns the values of the 'A' row, so it will display the values
#which corresponds to the columns, 'W', 'X', 'Y', 'Z'.

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [83]:
#REFERENCE MULTIPLE ROWS AT THE SAME TIME

df.loc[['A','B']] #always remember to use double brackets, if you want to select
#multiple things. pass it on as if it were a list which you will reference on.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [85]:
#WHEN TO USE SINGLE BRACKETS TO REFERENCE A SINGLE ROW AND A SINGLE COLUMN - 
#AT THE SAME TIME

df.loc['B','Y'] #by using single brackets, and a coma, this would mean that you
#are referencing 'B' as a ROW, and 'Y' as a column.

-0.8480769834036315

In [87]:
#HOW TO REFRENCE MULTIPLE ROWS AND COLUMNS - AT THE SAME TIME

df.loc[['A','B'],['W','Y']] #as previously stated, if you want to reference
#multiple things, you want to pass it on as if it were a list. the first set
#of inner brackets reference a list of ROWS containing ROW 'A' and ROW 'B', 
#while the second set of inner brackets reference a list of COLUMNS containing 
#COLUMN 'W' and COLUMN 'Y'.

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [89]:
#REFERENCE A SINGLE ROW ONLY - ROWS

#second way:

df.iloc[0] #'iloc' stands for index location

#this code, returns the values of 'A' row similar to the previous command, 
#however you must note that you are accessing 'A' row using it's index number
#representation which is '0'

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [91]:
#NEXT LESSONS---------------------------------------------------------->

In [93]:
#by using this code, you happen to compare the values within the 'df' dataframe
#against '0'. You are asking if whethere the value is 'TRUE' or 'FALSE' greater
#than zero.

df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [95]:
#HOW TO USE CONDITIONAL SELECTION WITHIN A DATAFRAME -

#by passing it into the variable 'booldf' and then referring to 'booldf' using
#brackets within the 'df' dataframe, you are telling the output to display
#the real number of the values.

#if the values meet the criteria of being greater than '0', then it will show up
#in the table, if not then it simply won't.

booldf = df > 0

df[booldf]

#Nan means 'null'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
#another way to shorten the code, instead of using a whole new variable to store
#what you want to happen, would simply to just use:

df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [99]:
df['W'] > 0 #the displayed output would result to a series of boolean values, not
#actual real numbers

#note that it is a SERIES

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [101]:
df['W'] #once you display the 'W' row on its own, you can say that the boolean
#value results displayed above is right about for example ROW 'A' under COLUMN 'W'
#being greater than '0', which is TRUE. 

#while ROW 'C' under the same COLUMN 'W' being greater than '0', happens to be
#FALSE ( as you are using a greater sign comparison operator)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [103]:
#you can now use the previous SERIES of boolean values (coded using 'df['W'] > 0')
#corresponding to ROWS to FILTER OUT ROWS based on a COLUMNS value.

df[df['W']>0] #with this code, if you pass on THAT boolean series into the inner
#brackets of another defined dataframe 'df', you will be able to output REAL 
#numbers and GET BACK the rows in which the values were TRUE.

#notice how ROW 'C' is no longer included in the output as it was previously
#FALSE.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [105]:
df['Z'] < 0 #another example which would output a series of BOOLEAN values only,
#determining which ROWS in COLUMN 'Z' are LESS THAN '0'

A    False
B    False
C     True
D    False
E    False
Name: Z, dtype: bool

In [107]:
df[df['Z'] < 0 ] #since the previous shows us that ALMOST ALL ROWS EXCEPT ROW 'C'
#is FALSE, the program would display an output of only ROW 'C's real numbers,
#because it was previously TRUE.

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [109]:
resultdf = df[df['W'] > 0] #you could store it in a variable such as 
#'resultdf' so that you can call it on command later.

resultdf #when you print out this variable, then the dataframe, without
#the ROW 'C' will be displayed as again 'df[df['W'] > 0]' would check if
#the condition of the ROW being greater than '0' has been met. In this
#case, ROW 'C' did not meet the condition, making it FALSE, and not being
#printed OUT.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [111]:
#HOW TO RETURN SINGLE COLUMN THAT STILL EXIST -
resultdf = df[df['W'] > 0]

resultdf['X'] #now from the current existing dataframe without ROW 'C',
#you can call on to view other elements which still are present or exist
#in the dataframe that has been changed.

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [113]:
#you can also do this all in one step:

df[df['W']>0]['X'] #since this is simply a dataframe, then you can stack
#commands such as bracket notation on top of that, such as the 'X' COLUMN
#which still exists in the current dataframe, because it has met the 
#conditions of 'df[df['W']>0]' making it TRUE.

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [115]:
#HOW TO RETURN MULTIPLE COLUMNS THAT STILL EXIST -

df[df['W']>0][['Y','X']] 

#this is a list of columns, as I stated last time
#you can call multiple COLUMNS by passing them on as a list like: 
#[['item1', 'item2']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [117]:
#to break the code above into easier steps for understanding:

boolser = df['W'] > 0        #<--- will check if ROWS under COLUMN 'Y' in
                             #the data frame has is either 'TRUE' or 
                             #'FALSE'. Note that 'df['W'] > 0 will not
                             #immediately display real numbers.
                             #It will then get stored in variable
                             #'boolser'.

result = df[boolser]         #<--- enclosing the variable 'boolser' in
                             #another .dataframe which is 'df', would now
                             #allow you to see the REAL numbers and not
                             #just TRUE or FALSE. This then gets stored
                             #in variable 'result'.

mycols = ['Y', 'X']          #<--- in the variable 'mycols' we store the
                             #list of columns (COLUMN 'Y' and COLUMN 'X')
                             #which we want to refer to later on.

result[mycols]               #<--- enclosing the variable 'mycols', which
                             #again contains COLUMN 'Y' and COLUMN 'X', 
                             #inside variable 'result' which contains
                             #the 'boolser' variable, which has now been
                             #transformed into REAL NUMBERS from simple 
                             #TRUE or FALSE contains, which contains
                             #the code: 'df['W'] > 0', will combine into
                             #the logic of:

                             #df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [119]:
# NOTE that this code is an example of returning subset of a dataframe by 
#only one condition:

df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [121]:
#HOW TO PASS TWO OR MORE CONDITIONS - 

#NOTE that python's normal 'and' operator cannot take on a series of 
#BOOLEAN values and compare it to another series of BOOLEAN values.

# 'df[ (df['W']>0) and (df['Y'] > 1)]'            <-- this is WRONG

#you have to use AMPERSAND '&' to combine them.

df[ (df['W']>0) & (df['Y'] > 1)]                 #<-- this is CORRECT

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [123]:
# you also cannot use 'or'.

# 'df[ (df['W']>0) or (df['Y'] > 1)]'             <-- this is WRONG

df[ (df['W']>0) | (df['Y'] > 1)]                 #<-- this is CORRECT

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [125]:
#if you want to reset the index representation and allow it to appear in
#a column you can do so by using this dataframe operation:

df.reset_index()

#this would allow you to actually see what your supposedly fake index is
#actually valued at. For example INDEX 'D' is '3'.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [127]:
#again just like other dataframe operations, unless you specify that you
#want it to retain having the information you have to set it still.

df #Notice how the changes did not retain.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [129]:
#similar to when you were dropping tables by using the code 
#'df.drop('new', axis = 1, inplace = True)', you would have to specify it
#to occur in place.

In [131]:
#'CA NY WY OR CO' are just american state abbreviations, that is a string
#argument. 

newind = 'CA NY WY OR CO'.split()

#'.split()' is a common method that would split up blank spaces.
#When you use '.split()', Python automatically converts the string into 
#a list of substrings based on spaces (or another delimiter you specify).

newind
#when you print it out, it creates a list of strings.

['CA', 'NY', 'WY', 'OR', 'CO']

In [133]:
#if for example it was:

newind2 = 'CA | NY | WY | OR | CO'.split('|')

#you can see that it isn't just a simple white space in between but '|'.
#if this is the case, you have to set a different delimeter on the
#'.split()' method.

#NOTE that you have to enclose any other delimeter between quotation marks
#if they arent just a white space.

newind2

['CA ', ' NY ', ' WY ', ' OR ', ' CO']

In [135]:
newind = 'CA NY WY OR CO'.split()

newind

df['States'] = newind 
#remember that when you want to create a new column in the dataframe,
#which is in this case, dataframe 'df' you have to use brackets and
#enclose a name you would want to refer to then set it with an '='
#sign, it's basically like how variables work, 'df['States']' act 
#as the package that will contain 'newind'. 

#remember that 'newind' is a list of strings, and since they are exactly
#fit to the number of ROWS (A-E) is 5 rows, there will not be any errors
#in sizing. 

df
#printing the dataframe out will set 'df['States'] as the COLUMN name or
#header, while the list of strings will be values assigned to each
#ROW intended.

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [137]:
#NEXT LESSONS---------------------------------------------------------->

In [139]:
import numpy as np
import pandas as pd

In [151]:
from numpy.random import randn

In [153]:
#Index Levels
    outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
    inside = [1,2,3,1,2,3]
    hier_index = list(zip(outside,inside))
    hier_index = pd.MultiIndex.from_tuples(hier_index)

In [155]:
#multi level index that shows the the key (e.g. 'G1') and value (e.g. '1')
#paired together. 
    hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [157]:
list(zip(outside,inside)) #zip is a built-in function that combines iterables
#like tuples, list, and sets.

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [149]:
#you are saying that you want to generate a '6' ROWS and '2' COLUMNS dataframe
#with randomized values from a standard normal distribution 
#(mean = 0, standard deviation = 1). using the 'randn' function.

df = pd.DataFrame(randn(6,2), hier_index,['A','B'])

#you can see that it has two levels of higher index, namely 'G1' and 'G2' level,
#and sub levels for each '1','2','3' for higher index 'G1' and '1','2','3' for 
#higher index 'G2'

#NOTE: that when a dataframe has multiple levels of index such as the one
#displayed below.

df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [174]:
#HOW TO CALL DATA FROM A MULTI-LEVEL INDEX HIERARCHY -

df.loc['G1']

#you are first referring to the content of the higher index 'G1', which will
#display the sublevel indexes '1','2','3'

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [176]:
#now if you do this:

df.loc['G1'].loc[1]

#you will return the results of the two COLUMNS corresponding to the ROW with
#the label sublevel index '1' to be displayed as a series.

#NOTE: you always call from the outside index first, before calling to somewhere
#much deeper.

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [178]:
df.index.names

#will show you that there is no existing name for higher indexes 'G1', 'G2' and
#their individual sublevel indexes '1','2','3' and '1','2','3'.

FrozenList([None, None])

In [182]:
#HOW TO GIVE A TITLE OR RENAME YOUR INDEX REPRESENTATIONS  -

#NOTICE: how the output 'FrozenList([None, None)], this is saying that the
#following indices dont have any names.

#by using:

df.index.names = ['Groups', 'Num']

#you have now created the name "Groups" for higher indexes 'G1' and 'G2' and
#the name "Num" for the sublevel or lower indices '1','2','3' and '1','2','3'.

df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [192]:
#HOW TO CALL DATA FROM A MULTI-LEVEL INDEX HIERARCHY (ANOTHER EXAMPLE) -

#suppose you you want to grab the value: '0.196800'

#it happens to be under higher level index 'G2', sublevel index '2', and COLUMN
#'B'

#use '.loc' function to always indicate an index, since you are using a
#multi-level index of 2 levels, suppose that you need to use '.loc' function
#twice to grab the desired value, and return it on display.

df.loc['G2'].loc[2]['B']

0.19679950499134005

In [194]:
#if you want to grab value: -0.116773

df.loc['G1'].loc[3]['A']

-0.11677331646707445

In [200]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [204]:
#CROSS VALIDATION TO RETURN DESIRED VALUES (EXAMPLE) -

#the '.xs()' method in pandas, is used to extract data
#from a dataframe based on index levels and multi-index
#dataframe.

#this code is saying that we want to display, grab, or
#return value or values where the multi-index level
#is named "Num" and has the value of sub-level index
#'1' or is equal to '1'

#simply, it filters to where "Num" is '1', leaving
#only the higher-level index named "Group".

#see in the above chart that the name "Num" which
#is used as a title for sub-level indices, '1','2','3'
#is no longer present when you display the code below.

#However, the values '-0.497104' and '-0.754070', of
#COLUMN 'A' and the values '0.238127' and '1.996652',
#of COLUMN 'B' groups,which is in accordance to sub-level
#("Num" title) index '1' has been returned.

#'.xs' quickly locates the value desired immediately
#instead of using multiple '.loc[]' to get to the desired
#level of index.

df.xs(1,level = 'Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652